app/controllers/orders_controller.rb

  def create
    @order = current_user.orders.build(order_params)
    @order.add_order_items(current_cart)
    @order.amount = current_cart.total
    @order.init_status

    if @order.save
      current_cart.destroy
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-04-10 11:31:18 UTC], ["updated_at", 2017-04-10 11:31:18 UTC]]
INSERT INTO "order_items" ("order_id", "product_id", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 1], ["product_id", 41], ["price", 9022], ["quantity", 2], ["created_at", 2017-04-10 05:51:11 UTC], ["updated_at", 2017-04-10 05:51:11 UTC]]
INSERT INTO "orders" ("user_id", "name", "phone", "address", "email", "created_at", "updated_at", "amount", "payment_method", "payment_status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]