app/controllers/products_controller.rb

  def add_to_cart
    @product = Product.find(params[:id])
    current_cart.add_cart_item(@product)
    @item = current_cart.find_item_by(@product)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = 21 ORDER BY "cart_items"."id" ASC LIMIT ?  [["cart_id", 5], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]