app/controllers/welcome_controller.rb

	def index
		@product = Product.all
---
SELECT "products".* FROM "products"