app/views/products/index.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 5]]
---
		</tr>
		<% current_cart.cart_items.each do |item| %>